import { Link } from "../types/header";

export const links: Link[] = [
  {
    title: "វិស័យ",
    items: [
      {
        id: 1,
        name: "វិស័យរដ្ឋបាលទូទៅ",
        items: [
          {
            id: 1,
            name: "ក្រសួងមហាផ្ទៃ",
            value: 121,
          },
          {
            id: 2,
            name: "ក្រសួងយុត្តិធម៌",
            value: 85,
          },
          {
            id: 3,
            name: "ក្រសួងការពារជាតិ",
            value: 90,
          },
        ],
      },
      {
        id: 2,
        name: "វិស័យសុខាភិបាល",
        items: [
          {
            id: 4,
            name: "ក្រសួងសុខាភិបាល",
            value: 200,
          },
          {
            id: 5,
            name: "ក្រសួងបរិស្ថាន",
            value: 75,
          },
        ],
      },
      {
        id: 3,
        name: "វិស័យអប់រំ",
        items: [
          {
            id: 6,
            name: "ក្រសួងអប់រំ យុវជន និងកីឡា",
            value: 150,
          },
          {
            id: 7,
            name: "ក្រសួងកសិកម្ម រុក្ខាប្រមាញ់ និងនេសាទ",
            value: 130,
          },
        ],
      },
      {
        id: 4,
        name: "វិស័យទេសចរណ៍ និងពាណិជ្ជកម្ម",
        items: [
          {
            id: 8,
            name: "ក្រសួងទេសចរណ៍",
            value: 95,
          },
          {
            id: 9,
            name: "ក្រសួងពាណិជ្ជកម្ម",
            value: 110,
          },
        ],
      },
    ],
  },
  {
    title: "គតិយុត្ត",
    items: [
      {
        id: 1,
        name: "វិស័យរដ្ឋបាលទូទៅ",
        items: [
          {
            id: 1,
            name: "ក្រសួងមហាផ្ទៃ",
            value: 100,
          },
          {
            id: 2,
            name: "ក្រសួងយុត្តិធម៌",
            value: 85,
          },
          {
            id: 3,
            name: "ក្រសួងការពារជាតិ",
            value: 90,
          },
        ],
      },
      {
        id: 2,
        name: "វិស័យសុខាភិបាល",
        items: [
          {
            id: 4,
            name: "ក្រសួងសុខាភិបាល",
            value: 200,
          },
          {
            id: 5,
            name: "ក្រសួងបរិស្ថាន",
            value: 75,
          },
        ],
      },
      {
        id: 4,
        name: "វិស័យទេសចរណ៍ និងពាណិជ្ជកម្ម",
        items: [
          {
            id: 8,
            name: "ក្រសួងទេសចរណ៍",
            value: 95,
          },
          {
            id: 9,
            name: "ក្រសួងពាណិជ្ជកម្ម",
            value: 110,
          },
        ],
      },
    ],
  },
  {
    title: "កម្មវិធីAI",
    items: [
      {
        id: 3,
        name: "វិស័យអប់រំ",
        items: [
          {
            id: 6,
            name: "ក្រសួងអប់រំ យុវជន និងកីឡា",
            value: 150,
          },
          {
            id: 7,
            name: "ក្រសួងកសិកម្ម រុក្ខាប្រមាញ់ និងនេសាទ",
            value: 130,
          },
        ],
      },
      {
        id: 4,
        name: "វិស័យទេសចរណ៍ និងពាណិជ្ជកម្ម",
        items: [
          {
            id: 8,
            name: "ក្រសួងទេសចរណ៍",
            value: 95,
          },
          {
            id: 9,
            name: "ក្រសួងពាណិជ្ជកម្ម",
            value: 110,
          },
        ],
      },
    ],
  },
];
